{
  "ProjectHeader": {
    "title": "Aprova Fácil",
    "publishDate": "Sep 01, 2020",
    "tags": "Mobile"
  },
  "ProjectImages": [
    {
      "title": "aprova",
      "img": "aprova"
    },
    {
      "title": "aprova",
      "img": "appClient"
    },
    {
      "title": "aprova",
      "img": "appManager"
    }
  ],
  "disclaimer": "images used are from the product website - © All rights reserved",
  "ProjectInfo": {
    "ClientHeading": "About",
    "CompanyInfo": [
      {
        "title": "Client",
        "details": "Aprova Fácil - 2 Mobile Apps"
      },
      {
        "title": "Services",
        "details": "Mobile Development (React Native)"
      },
      {
        "title": "Website",
        "details": "https://approvafacil.com.br/"
      }
    ],
    "ObjectivesHeading": "Objective",
    "ObjectivesDetails": "I've had been contracted as a front-end developer and worked in internal solutions",
    "Technologies": [
      {
        "title": "Tools & Technologies",
        "techs": [
          "React.js",
          "React Native",
          "Redux Toolkit",
          "axios",
          "Android",
          "Ios",
          "whatsApp Integration",
          "i18n"
        ]
      }
    ],
    "Heading": "Challenge",
    "Details": [
      "When I was acting as Mobile Developer using React Native, my primary responsibility is to enhance and maintain two applications by leveraging modern technologies and integrations. These applications was vital tools for our users and depend on React Native, Redux Toolkit, back-end APIs, and WhatsApp Chatbot integration for their functionality.",
      "I played a pivotal role in improving and expanding the features and functionalities of the two mobile applications. This involved understanding user requirements, collaborating with other developers, and builded  these needs into practical solutions.",
      "My work heavily relied on React Native, a popular framework for build cross-platform mobile applications. I leveraged this technology to create user interfaces that are both visually appealing across Android and iOS platforms.",
      "To manage application state efficiently, I employed Redux Toolkit. This state management library helped in centralizing and synchronizing application data, ensuring a seamless user experience and making it easier to maintain complex application states.",
      "The applications I worked on relyed on data from a back-end API. I was responsible for integrating with this API to retrieve and display relevant information, ensuring data consistency and real-time updates.",
      "One of the key features I implemented was integrating WhatsApp into the applications. This allowed users to interact with the applications and share content through WhatsApp, enhancing user engagement and communication.",
      "I maintained clear and comprehensive documentation for the codebase, making it easier for other team members to understand, extend, and maintain the applications over time.",
      "And acted as support on a NodeJS chat bot that fowarded documents for users and get user preferences for real estate suggestion integrated with WhatsApp using Twilio API."
    ]
  }
}
