{
  "ProjectHeader": {
    "title": "Escala Plantões",
    "publishDate": "May 01, 2022",
    "tags": "Back-end / Front-end"
  },
  "ProjectImages": [
    {
      "title": "Escala Plantões",
      "img": "plantoes"
    },
    {
      "title": "Escala Plantões",
      "img": "schedules"
    },
    {
      "title": "Escala Plantões",
      "img": "admin"
    }
  ],
  "disclaimer": "images used are from the product website - © All rights reserved",
  "ProjectInfo": {
    "ClientHeading": "About",
    "CompanyInfo": [
      {
        "title": "Client",
        "details": "Escala App - Hospital Israelita Albert Einstein"
      },
      {
        "title": "Services",
        "details": "Backend & Frontend Development"
      },
      {
        "title": "Website",
        "details": "https://escala.app/produtos/escala-plantoes"
      }
    ],
    "ObjectivesHeading": "Objective",
    "ObjectivesDetails": "I've had been contracted as a senior developer to work on the product",
    "Technologies": [
      {
        "title": "Tools & Technologies",
        "techs": [
          "HTML 5",
          "CSS 3",
          "JavaScript",
          "React.js",
          "Angular",
          "Bootstrap",
          "Materialize",
          "Micro-Frontend",
          "PHP",
          "Laravel",
          "Mysql",
          "AWS"
        ]
      }
    ],
    "Heading": "Challenge",
    "Details": [
      "As a Full Stack Developer, I play a role in maintaining and enhancing an 8-year-old software system. My responsibilities encompass a wide range of technical tasks, ensuring the system's continued functionality and adaptability to evolving business needs.",
      "I am responsible for maintaining and improving an aging software system to ensure it remains current and relevant. This involves analyzing the existing codebase, identifying areas that need improvement, and planning for necessary upgrades.",
      "One of my key responsibilities is to develop, and implement new features for the system. This involves creating technical specifications, and writing code to meet the task specifications.",
      "I regularly troubleshoot and fix bugs in the system, whether they are related to functionality, performance, or security. I work closely with the team to identify and resolve these issues efficiently.",
      "I make technical decisions related to architecture, tools, and frameworks. This includes choosing the most suitable technologies for feature development and guiding the team in their implementation.",
      "I am responsible for code reviews, and ensuring that the team's work aligns with the project's code quality. I provide guidance and mentorship to junior developers, fostering their growth and development.",
      "I make technical decisions related to architecture, tools, and frameworks. This includes choosing the most suitable technologies for feature development and guiding the team in their implementation.",
      "Effective communication is a critical aspect of my role. I collaborate with various stakeholders, such as product managers, designers, and other departments, to understand their needs and provide technical insights. I also ensure that the team is well-informed and aligned with project objectives.",
      "I maintain clear and comprehensive documentation for the system and its components, making it easier for team members to understand and work with the codebase.",
      "As technology is continually evolving, I am committed to staying up-to-date with the latest industry trends, tools, and best practices. I encourage my team members to do the same."
    ]
  }
}
