{
  "ProjectHeader": {
    "title": "Provu",
    "publishDate": "Sep 01, 2019",
    "tags": "Front-end"
  },
  "ProjectImages": [
    {
      "title": "provu",
      "img": "provu"
    },
    {
      "title": "provu",
      "img": "provuSimulator"
    },
    {
      "title": "provu",
      "img": "provuScreen"
    }
  ],
  "disclaimer": "images used are from the product website - © All rights reserved",
  "ProjectInfo": {
    "ClientHeading": "About",
    "CompanyInfo": [
      {
        "title": "Provu",
        "details": "CNPJ: 20.265.259/0001-71"
      },
      {
        "title": "Services",
        "details": "Front-end Development"
      },
      {
        "title": "Website",
        "details": "https://provu.com.br/"
      }
    ],
    "ObjectivesHeading": "Objective",
    "ObjectivesDetails": "I've had been contracted as a front-end developer to refactor of old Angular application to new react application with redux saga, and component libary",
    "Technologies": [
      {
        "title": "Tools & Technologies",
        "techs": [
          "React.js",
          "Redux Saga",
          "axios",
          "Angular",
          "Yup",
          "jest",
          "i18n",
          "formik",
          "styled-components",
          "storybook"
        ]
      }
    ],
    "Heading": "Challenge",
    "Details": [
      "As a Front-End Developer, my primary responsibility was to refactor an existing Angular application into a new React application while implementing modern front-end development practices and tools. This involved the integration of Redux Saga for state management, the creation of a design system using Styled Components, and the implementation of component validation with Formik and Yup, with comprehensive testing using Jest and react testing library.",
      "I was tasked with transforming an outdated Angular application into a modern React application. This involved migrating existing components and functionality to the React framework.",
      "My role hinged on my proficiency in React, allowing me to create dynamic and responsive user interfaces, ensuring a smooth user experience while adhering to current industry best practices.",
      "To effectively manage the application's state and handle asynchronous operations, I incorporate Redux Saga. This middleware helped in orchestrating complex data flows and side effects, ensuring data consistency and reliability.",
      "I was responsible for establishing a design system to maintain visual consistency throughout the application. This designed system included reusable UI components built with Styled Components, enhancing code maintainability and consistency in design.",
      "I used Formik and Yup to implement robust form validation for user data input, making sure data submitted by users was accurate and adheres to predefined standards. This ensured data quality and user experience.",
      "Quality assurance was a fundamental aspect of my role. I conducted comprehensive testing using Jest, and react testing library ensuring that the refactored application was free of defects and behaves as expected. This included unit testing, integration testing, and snapshot testing.",
      "I focused on creating responsive designs, ensuring that the application looked and functions well on a variety of devices and screen sizes.",
      "Part of the refactoring process involved optimizing code for performance and maintainability. I reviewed and refactor the codebase to improve readability and efficiency."
    ]
  }
}
